import streamlit as st

st.set_page_config(layout="wide")

st.title("수학교육평가론 1조 : 자동 채점 및 피드백 모델 개발")
st.write("**팀원** : 수학교육과 김명식, 김재훈, 김지영, 신인섭, 윤예린, 정유진")

st.subheader(":one: 기획 의도")

st.write("과정 중심 평가에 이용하는 서술형 평가 문제의 답안을")   
st.write("① 자동 채점 모델을 통하여 신속하게 채점하고")
st.write("② 각 학생들에게 부족한 지식요소 및 오개념을 파악한 후")         
st.write("③ 결과를 토대로 학생들에게 피드백을 줄 수 있는 것")
st.write(" 이 이 프로젝트의 목표이자 의도임.")


st.subheader(":two: 프로젝트 과정")

st.write(" 문제를 정하여 실제 중학교 2학년 학생 241명을 대상으로 서술형 풀이 답안을 받은 뒤, 답안을 텍스트 데이터로 변환, 이를 활용하여 자동 채점과 피드백 모델을 개발")
  
st.subheader(":three: 기대 효과 및 활용 가능성")

st.write("① 첫 시간의 화두였던 '성취 지식 및 교과 역량에 대한 맞춤형 평가' 를 기대할 수 있음")
st.write("② 100%의 채점 정확도를 보여주지는 않지만, 기존의 방식대로 교사가 100% 수작업으로 학생들의 서술형 답안을 루브릭에 맞추어 일일이 채점하는 것보다 시간을 많이 절약할 수 있음")
st.write("③ 지식요소와 오개념에 대한 인공지능 모델의 분류 결과와 교사의 판단을 통합하여 학생들에게 피드백을 줄 수 있을 것이라고 보임")

st.subheader(":four: 목차")

st.write("(1) 문항설계(1): 전반적인 문항 설계 원리와 해당 과목을 선택한 이유")
st.write("(2) 문항설계(2): 대표 문항 설계에 대한 내용")
st.write("(3) 문항설계(3): 전체 문항에 대한 내용")
st.write("(4) 프로젝트 설계: 구체적인 프로젝트 진행 과정")
st.write("(5) 데이터 전처리: 데이터를 전처리하는 과정 및 결과 설명")
st.write("(6) 모델 설명: 프로젝트에 사용한 모델의 종류 설명")
st.write("(7) 결과: 실험 결과 설명")
st.write("(8) 피드백(1): 자동 채점 모델 기반 자동 피드백 설명")
st.write("(9) 피드백(2): 자동 채점 모델 기반 자동 피드백 설명")
st.write("(10) 생각할거리")